www/app/Controllers/Deed.php

SELECT *
FROM `deed`
---
	public function index()
	{
		//$data[]=array();
	    $data = [
                'controller'    	=> 'deed',
                'title'     		=> 'Deed',
				'uploads'			=> $this->deedModel->findAll()