www/app/Controllers/Deed.php

SELECT `id`, `subcontractor_id`, `project_id`, `title`, `file_path`, `file_type`
FROM `deed`
---
	public	function getAll() {
		$response = array();

		$data[ 'data' ] = array();

		$result = $this->deedModel->select( 'id, subcontractor_id, project_id, title, file_path, file_type' )->findAll();