www/app/Controllers/Home.php

    public function index()
    {
        $userType = session()->get('user_type');
        if ($userType == 'Administrator') {
            $data['pending'] = array();
            $dat = $this->requisitionModel->where('status', 'Pending')->findAll();
---
SELECT *
FROM `requisition`
WHERE `status` = 'Pending'