www/app/Controllers/Login.php

SELECT *
FROM `tbl_user`
WHERE `id` = '6'
 LIMIT 1
UPDATE `tbl_user` SET `password` = '202cb962ac59075b964b07152d234b70'
WHERE `tbl_user`.`id` IN ('6')
---
    public function passchangeUser()
    {
        $session = session();
        $model = new UsersModel();
        $fields['id'] = session()->get('user_id');

        $cur_password = $this->request->getPost('cur_password');
        $new_password = $this->request->getPost('new_password');
        $con_new_password = $this->request->getPost('con_new_password');

        $data = $model->where('id', $fields['id'])->first();

        if ($new_password == $con_new_password) {
            if ($data) {
                if (md5($cur_password) == $data['password']) {
                    $fields['password'] = md5($new_password);
                    $model->update($fields['id'], $fields);