www/app/Controllers/ProjectFilesUpload.php

SELECT *
FROM `project_files`
WHERE `project_id` = '1'
---
	public function getAll()
	{
		$response = array();
		$data['data'] = array();
		$id = $this->request->getPost('id');
		$result = $this->projectfilesModel->where('project_id', $id)->findAll();