www/app/Controllers/Requisition.php

SELECT `id`, `project_id`, `requested_amount`, `submit_date_time`, `recieved_amount`, `recieve_date_time`, `status`, `comment`
FROM `requisition`
ORDER BY `id` DESC
---
    public function getAll()
    {
        $response = array();
        $data['data'] = array();
        $result = $this->requisitionModel->select('id, project_id, requested_amount, submit_date_time, recieved_amount, recieve_date_time, status, comment')->findAll();

DELETE FROM `requisition`
WHERE `id` = '1'
---
    public function remove()
    {
        $response = array();

        $id = $this->request->getPost('id');

        if (!$this->validation->check($id, 'required|numeric')) {

            throw new \CodeIgniter\Exceptions\PageNotFoundException();

        } else {

            if ($this->requisitionModel->where('id', $id)->delete()) {