www/app/Controllers/Subcontractorfiles.php

	public function getAll()
	{
 		$response = array();
	    $data['data'] = array();
		$id = $this->request->getPost('id');
		$result = $this->subcontractorfilesModel->where('subcontractorid' ,$id)->findAll();
---
SELECT *
FROM `subcontractor_files`
WHERE `subcontractorid` IS NULL