www/app/Controllers/Tmpexpensedetail.php

SELECT `id`, `head_id`, `item_id`, `category_id`, `brand_id`, `model_id`, `size_id`, `unit_id`, `rate`, `qty`, `amount`
FROM `tmp_expense_detail`
---
    public function getAll()
    {
        $response = array();

        $data['data'] = array();

        $result = $this->tmpexpensedetailModel->select('id, head_id, item_id, category_id, brand_id, model_id, size_id, unit_id, rate, qty, amount')->findAll();

INSERT INTO `tmp_expense_detail` (`head_id`, `item_id`, `category_id`, `brand_id`, `model_id`, `size_id`, `unit_id`, `rate`, `qty`, `amount`) VALUES ('1', '1', '1', '1', '1', '1', '0', '5645646', '564564', '5464564')
---
            $response['success'] = false;
            $response['messages'] = $this->validation->listErrors();
        } else {
            if ($this->tmpexpensedetailModel->insert($fields)) {

SELECT `id`, `head_id`, `item_id`, `category_id`, `brand_id`, `model_id`, `size_id`, `unit_id`, `rate`, `qty`, `amount`
FROM `tmp_expense_detail`
---
        }

        $data['data'] = array();
        $result = $this->tmpexpensedetailModel->select('id, head_id, item_id, category_id, brand_id, model_id, size_id, unit_id, rate, qty, amount')->findAll();