www/app/Controllers/UploadVoucher.php

	public function index($id = 0)
	{
		$data = [
			'controller' => 'Tmpexpensedetail',
			'title' => 'UploadVoucher'
		];
		$db = \Config\Database::connect();
		// $builder = $db->table('daily_expense_summary d');
		// $builder->select('d.id,p.project_name,u.full_name,d.amount,d.date_time,d.comment');
		// $builder->join('projects p', 'p.id = d.project_id', 'inner');
		// $builder->join('tbl_user u', 'u.id = d.user_id', 'inner');
		// $result = $builder->orderBy('d.id', 'desc')->get()->getResult();
		// print_r($result);

		// return view('summary_entry');

		//Heads
		$builder = $db->table('expense_heads');
		$result = $builder->get()->getResult();
		foreach ($result as $key => $value) {
			$data['heads'][$value->id] = $value->head;
		}

		//Items
		$builder = $db->table('items');
		$result = $builder->get()->getResult();
---
SELECT *
FROM `expense_heads`
SELECT *
FROM `items`


		//Category
		$builder = $db->table('category');
		$result = $builder->get()->getResult();
---
SELECT *
FROM `category`


		//Brand
		$builder = $db->table('brands');
		$result = $builder->get()->getResult();
---
SELECT *
FROM `brands`


		//Model
		$builder = $db->table('models');
		$result = $builder->get()->getResult();
---
SELECT *
FROM `models`


		//Size
		$builder = $db->table('sizes');
		$result = $builder->get()->getResult();
---
SELECT *
FROM `sizes`


		//Unit
		$builder = $db->table('units');
		$result = $builder->get()->getResult();
---
SELECT *
FROM `units`