www/app/Controllers/Upload.php

SELECT *
FROM `subcontractor_files`
WHERE `id` = '1'
 LIMIT 1
---
	public function index($id=0)
	{
		$data['data'] = array();
		$subcontractorsModel = new SubcontractorsModel();
		$subcontractorfilesModel = new subcontractorfilesModel();

		$data['data'] = $subcontractorsModel->where('id' ,$id)->first();
		$data['files'] = $subcontractorfilesModel->where('id' ,$id)->first();